; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=5, packages=14, locations=14, density=0.16483516483516483, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=29, seed=70

(define (problem transport-29)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l6)
    (at p2 l2)
    (at p3 l3)
    (at p4 l14)
    (at p5 l11)
    (at p6 l11)
    (at p7 l10)
    (at p8 l4)
    (at p9 l12)
    (at p10 l11)
    (at p11 l7)
    (at p12 l13)
    (at p13 l7)
    (at p14 l4)
    (at v1 l7)
    (at v2 l11)
    (at v3 l2)
    (at v4 l9)
    (at v5 l6)
    (road l5 l13)
    (road l1 l6)
    (road l2 l12)
    (road l11 l14)
    (road l12 l9)
    (road l6 l14)
    (road l12 l2)
    (road l8 l14)
    (road l10 l7)
    (road l7 l10)
    (road l10 l9)
    (road l12 l3)
    (road l5 l4)
    (road l11 l4)
    (road l12 l14)
    (road l4 l5)
    (road l14 l6)
    (road l9 l10)
    (road l4 l11)
    (road l14 l11)
    (road l3 l12)
    (road l6 l1)
    (road l13 l5)
    (road l14 l12)
    (road l14 l8)
    (road l9 l12)
    (road l3 l9)
    (road l9 l3)
    )
 (:goal  (and 
    (at p1 l5)
    (at p2 l12)
    (at p3 l10)
    (at p4 l1)
    (at p5 l13)
    (at p6 l13)
    (at p7 l9)
    (at p8 l10)
    (at p9 l4)
    (at p10 l3)
    (at p11 l1)
    (at p12 l8)
    (at p13 l14)
    (at p14 l9))))

; plan
1. (drive v5 l6 l1)
   deleted: (at v5 l6)
   added: (at v5 l1)
   goals met: 0 of 14
2. (pick-up v3 l2 p2 c1 c2)
   deleted: (at p2 l2) (capacity v3 c2)
   added: (in p2 v3) (capacity v3 c1)
   goals met: 0 of 14
3. (pick-up v2 l11 p10 c1 c2)
   deleted: (at p10 l11) (capacity v2 c2)
   added: (in p10 v2) (capacity v2 c1)
   goals met: 0 of 14
4. (drive v2 l11 l14)
   deleted: (at v2 l11)
   added: (at v2 l14)
   goals met: 0 of 14
5. (drive v1 l7 l10)
   deleted: (at v1 l7)
   added: (at v1 l10)
   goals met: 0 of 14
6. (pick-up v1 l10 p7 c0 c1)
   deleted: (at p7 l10) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 0 of 14
7. (drive v1 l10 l9)
   deleted: (at v1 l10)
   added: (at v1 l9)
   goals met: 0 of 14
8. (drop v1 l9 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l9) (capacity v1 c1)
   goals met: 1 of 14
9. (drive v3 l2 l12)
   deleted: (at v3 l2)
   added: (at v3 l12)
   goals met: 1 of 14
10. (drop v3 l12 p2 c1 c2)
   deleted: (in p2 v3) (capacity v3 c1)
   added: (at p2 l12) (capacity v3 c2)
   goals met: 2 of 14
11. (drive v1 l9 l3)
   deleted: (at v1 l9)
   added: (at v1 l3)
   goals met: 2 of 14
12. (pick-up v1 l3 p3 c0 c1)
   deleted: (at p3 l3) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 14
13. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 2 of 14
14. (drive v1 l9 l10)
   deleted: (at v1 l9)
   added: (at v1 l10)
   goals met: 2 of 14
15. (drop v1 l10 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l10) (capacity v1 c1)
   goals met: 3 of 14
16. (drive v1 l10 l7)
   deleted: (at v1 l10)
   added: (at v1 l7)
   goals met: 3 of 14
17. (pick-up v1 l7 p13 c0 c1)
   deleted: (at p13 l7) (capacity v1 c1)
   added: (in p13 v1) (capacity v1 c0)
   goals met: 3 of 14
18. (drive v1 l7 l10)
   deleted: (at v1 l7)
   added: (at v1 l10)
   goals met: 3 of 14
19. (drive v1 l10 l9)
   deleted: (at v1 l10)
   added: (at v1 l9)
   goals met: 3 of 14
20. (drive v1 l9 l12)
   deleted: (at v1 l9)
   added: (at v1 l12)
   goals met: 3 of 14
21. (drive v1 l12 l14)
   deleted: (at v1 l12)
   added: (at v1 l14)
   goals met: 3 of 14
22. (drop v1 l14 p13 c0 c1)
   deleted: (in p13 v1) (capacity v1 c0)
   added: (at p13 l14) (capacity v1 c1)
   goals met: 4 of 14
23. (pick-up v1 l14 p4 c0 c1)
   deleted: (at p4 l14) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 4 of 14
24. (drive v1 l14 l6)
   deleted: (at v1 l14)
   added: (at v1 l6)
   goals met: 4 of 14
25. (drive v1 l6 l1)
   deleted: (at v1 l6)
   added: (at v1 l1)
   goals met: 4 of 14
26. (drop v1 l1 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l1) (capacity v1 c1)
   goals met: 5 of 14
27. (drive v2 l14 l12)
   deleted: (at v2 l14)
   added: (at v2 l12)
   goals met: 5 of 14
28. (drive v2 l12 l3)
   deleted: (at v2 l12)
   added: (at v2 l3)
   goals met: 5 of 14
29. (pick-up v3 l12 p9 c1 c2)
   deleted: (at p9 l12) (capacity v3 c2)
   added: (in p9 v3) (capacity v3 c1)
   goals met: 5 of 14
30. (drop v2 l3 p10 c1 c2)
   deleted: (in p10 v2) (capacity v2 c1)
   added: (at p10 l3) (capacity v2 c2)
   goals met: 6 of 14
31. (drive v3 l12 l9)
   deleted: (at v3 l12)
   added: (at v3 l9)
   goals met: 6 of 14
32. (drive v5 l1 l6)
   deleted: (at v5 l1)
   added: (at v5 l6)
   goals met: 6 of 14
33. (pick-up v5 l6 p1 c0 c1)
   deleted: (at p1 l6) (capacity v5 c1)
   added: (in p1 v5) (capacity v5 c0)
   goals met: 6 of 14
34. (drive v5 l6 l14)
   deleted: (at v5 l6)
   added: (at v5 l14)
   goals met: 6 of 14
35. (drive v5 l14 l11)
   deleted: (at v5 l14)
   added: (at v5 l11)
   goals met: 6 of 14
36. (drive v5 l11 l4)
   deleted: (at v5 l11)
   added: (at v5 l4)
   goals met: 6 of 14
37. (drive v5 l4 l5)
   deleted: (at v5 l4)
   added: (at v5 l5)
   goals met: 6 of 14
38. (drop v5 l5 p1 c0 c1)
   deleted: (in p1 v5) (capacity v5 c0)
   added: (at p1 l5) (capacity v5 c1)
   goals met: 7 of 14
39. (drive v5 l5 l13)
   deleted: (at v5 l5)
   added: (at v5 l13)
   goals met: 7 of 14
40. (pick-up v5 l13 p12 c0 c1)
   deleted: (at p12 l13) (capacity v5 c1)
   added: (in p12 v5) (capacity v5 c0)
   goals met: 7 of 14
41. (drive v5 l13 l5)
   deleted: (at v5 l13)
   added: (at v5 l5)
   goals met: 7 of 14
42. (drive v5 l5 l4)
   deleted: (at v5 l5)
   added: (at v5 l4)
   goals met: 7 of 14
43. (drive v5 l4 l11)
   deleted: (at v5 l4)
   added: (at v5 l11)
   goals met: 7 of 14
44. (drive v5 l11 l14)
   deleted: (at v5 l11)
   added: (at v5 l14)
   goals met: 7 of 14
45. (drive v5 l14 l8)
   deleted: (at v5 l14)
   added: (at v5 l8)
   goals met: 7 of 14
46. (drop v5 l8 p12 c0 c1)
   deleted: (in p12 v5) (capacity v5 c0)
   added: (at p12 l8) (capacity v5 c1)
   goals met: 8 of 14
47. (drive v5 l8 l14)
   deleted: (at v5 l8)
   added: (at v5 l14)
   goals met: 8 of 14
48. (drive v5 l14 l11)
   deleted: (at v5 l14)
   added: (at v5 l11)
   goals met: 8 of 14
49. (pick-up v5 l11 p5 c0 c1)
   deleted: (at p5 l11) (capacity v5 c1)
   added: (in p5 v5) (capacity v5 c0)
   goals met: 8 of 14
50. (drive v5 l11 l4)
   deleted: (at v5 l11)
   added: (at v5 l4)
   goals met: 8 of 14
51. (drive v5 l4 l5)
   deleted: (at v5 l4)
   added: (at v5 l5)
   goals met: 8 of 14
52. (drive v5 l5 l13)
   deleted: (at v5 l5)
   added: (at v5 l13)
   goals met: 8 of 14
53. (drop v5 l13 p5 c0 c1)
   deleted: (in p5 v5) (capacity v5 c0)
   added: (at p5 l13) (capacity v5 c1)
   goals met: 9 of 14
54. (drive v5 l13 l5)
   deleted: (at v5 l13)
   added: (at v5 l5)
   goals met: 9 of 14
55. (drive v5 l5 l4)
   deleted: (at v5 l5)
   added: (at v5 l4)
   goals met: 9 of 14
56. (drive v5 l4 l11)
   deleted: (at v5 l4)
   added: (at v5 l11)
   goals met: 9 of 14
57. (pick-up v5 l11 p6 c0 c1)
   deleted: (at p6 l11) (capacity v5 c1)
   added: (in p6 v5) (capacity v5 c0)
   goals met: 9 of 14
58. (drive v5 l11 l4)
   deleted: (at v5 l11)
   added: (at v5 l4)
   goals met: 9 of 14
59. (drive v5 l4 l5)
   deleted: (at v5 l4)
   added: (at v5 l5)
   goals met: 9 of 14
60. (drive v5 l5 l13)
   deleted: (at v5 l5)
   added: (at v5 l13)
   goals met: 9 of 14
61. (drop v5 l13 p6 c0 c1)
   deleted: (in p6 v5) (capacity v5 c0)
   added: (at p6 l13) (capacity v5 c1)
   goals met: 10 of 14
62. (drive v3 l9 l12)
   deleted: (at v3 l9)
   added: (at v3 l12)
   goals met: 10 of 14
63. (drive v3 l12 l14)
   deleted: (at v3 l12)
   added: (at v3 l14)
   goals met: 10 of 14
64. (drive v3 l14 l11)
   deleted: (at v3 l14)
   added: (at v3 l11)
   goals met: 10 of 14
65. (drive v3 l11 l4)
   deleted: (at v3 l11)
   added: (at v3 l4)
   goals met: 10 of 14
66. (drop v3 l4 p9 c1 c2)
   deleted: (in p9 v3) (capacity v3 c1)
   added: (at p9 l4) (capacity v3 c2)
   goals met: 11 of 14
67. (drive v4 l9 l10)
   deleted: (at v4 l9)
   added: (at v4 l10)
   goals met: 11 of 14
68. (pick-up v3 l4 p14 c1 c2)
   deleted: (at p14 l4) (capacity v3 c2)
   added: (in p14 v3) (capacity v3 c1)
   goals met: 11 of 14
69. (pick-up v3 l4 p8 c0 c1)
   deleted: (at p8 l4) (capacity v3 c1)
   added: (in p8 v3) (capacity v3 c0)
   goals met: 11 of 14
70. (drive v3 l4 l11)
   deleted: (at v3 l4)
   added: (at v3 l11)
   goals met: 11 of 14
71. (drive v3 l11 l14)
   deleted: (at v3 l11)
   added: (at v3 l14)
   goals met: 11 of 14
72. (drive v3 l14 l12)
   deleted: (at v3 l14)
   added: (at v3 l12)
   goals met: 11 of 14
73. (drive v3 l12 l9)
   deleted: (at v3 l12)
   added: (at v3 l9)
   goals met: 11 of 14
74. (drop v3 l9 p14 c0 c1)
   deleted: (in p14 v3) (capacity v3 c0)
   added: (at p14 l9) (capacity v3 c1)
   goals met: 12 of 14
75. (drive v3 l9 l10)
   deleted: (at v3 l9)
   added: (at v3 l10)
   goals met: 12 of 14
76. (drop v3 l10 p8 c1 c2)
   deleted: (in p8 v3) (capacity v3 c1)
   added: (at p8 l10) (capacity v3 c2)
   goals met: 13 of 14
77. (drive v1 l1 l6)
   deleted: (at v1 l1)
   added: (at v1 l6)
   goals met: 13 of 14
78. (drive v1 l6 l14)
   deleted: (at v1 l6)
   added: (at v1 l14)
   goals met: 13 of 14
79. (drive v1 l14 l12)
   deleted: (at v1 l14)
   added: (at v1 l12)
   goals met: 13 of 14
80. (drive v1 l12 l9)
   deleted: (at v1 l12)
   added: (at v1 l9)
   goals met: 13 of 14
81. (drive v1 l9 l10)
   deleted: (at v1 l9)
   added: (at v1 l10)
   goals met: 13 of 14
82. (drive v1 l10 l7)
   deleted: (at v1 l10)
   added: (at v1 l7)
   goals met: 13 of 14
83. (pick-up v1 l7 p11 c0 c1)
   deleted: (at p11 l7) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 13 of 14
84. (drive v1 l7 l10)
   deleted: (at v1 l7)
   added: (at v1 l10)
   goals met: 13 of 14
85. (drive v1 l10 l9)
   deleted: (at v1 l10)
   added: (at v1 l9)
   goals met: 13 of 14
86. (drive v1 l9 l12)
   deleted: (at v1 l9)
   added: (at v1 l12)
   goals met: 13 of 14
87. (drive v1 l12 l14)
   deleted: (at v1 l12)
   added: (at v1 l14)
   goals met: 13 of 14
88. (drive v1 l14 l6)
   deleted: (at v1 l14)
   added: (at v1 l6)
   goals met: 13 of 14
89. (drive v1 l6 l1)
   deleted: (at v1 l6)
   added: (at v1 l1)
   goals met: 13 of 14
90. (drop v1 l1 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l1) (capacity v1 c1)
   goals met: 14 of 14
